package Test121ThreadLock;

public class Test {
    public static void main(String[] args) {
        /*
            为什么会出现线程安全问题？
            1.是否多线程环境
            2.是否共享数据
            3.是否多条语句操作共享数据

            解决的原理：(Runnable接口的实现类对象简称R对象，Thread-xx简称Txx)
            前提：
            1.每个线程类对象封装的R对象是一致的，意味着每个线程都将操作同一个对象，使用的实例字段和实例方法是相同的，即共享数据

            本质结论：
            2.那么各个线程中使用R对象调用方法的时候，只要能保证不影响调用前后R对象的实例字段，就不会影响到其他线程的操作，即不会引发线程安全问题

            原因：
            3.若各个线程调用的方法会影响到这个实例字段，就会导致实例字段对于其他线程而言发生跳跃性的变化

            举例：
            4.比如T1在使用R对象调用实例方法使用了实例字段number = 100;，那么当T1执行完成后number变成了99(假设实例方法做的是循环输出number后减一的操作)
            5.若其他线程比如T2、T3，也在执行相同的循环操作，就会使得T1执行下一个循环时，数据不是99，而是98、97等等
            6.而如果T2、T3在T1输出结果之后，减一操作之前，就开始输出内容了，就会导致T1、T2、T3输出的内容是一样的

            解决：
            7.线程安全问题的本质就是多线程同时使用R对象执行操作实例字段的实例方法
            8.所以解决办法就是一次只允许一个线程执行该实例方法
            9.比如使用synchronized关键字或者lock接口的实现类对象调用相应的方法，对实例方法或主要的代码块“上锁”
            10.使得一个线程抢到这个代码的执行权时，其他的线程不能执行这块危险的内容
         */

        LockClass st = new LockClass();

        Thread t1 = new Thread(st, "窗口1");
        Thread t2 = new Thread(st, "窗口2");
        Thread t3 = new Thread(st, "窗口3");

        t1.setPriority(5);
        t2.setPriority(5);
        t3.setPriority(5);

        t1.start();
        t2.start();
        t3.start();
    }
}
